 [{
        "country": "India",
        "genre": "Comedy, Bollywood, Musical",
        "lang": "Hindi Language",
        "name": "Welcome",
        "release": 2007,
        "summary": "Uday , a criminal don, takes it upon himself to get his kindhearted sister, Sanjana  married, but he is unsuccessful since no one wants to be associated with a crime family. Dr. Ghunghroo  has also been trying to get his nephew, Rajiv , married but due to his conditionthe alliance must be with a purely decent familyhe is also unsuccessful. When Rajiv jumps into a burning building to save Sanjana, he is smitten by her. Uday and Majnu , Uday's brother, hatch a plan for an alliance with Dr. Ghunghroo. The plan works and Dr. Ghunghroo confirms the alliance, thinking that Uday is a very decent man. But when he is later told that Uday and Majnu are mobsters, he quickly takes his family and flees to Sun City, South Africa to escape. However, Majnu and Sanjana have come to Sun City as well. Rajiv meets Sanjana again and the two fall in love. Dr. Ghunghroo reconciles with Uday and Majnu and finally agrees to the alliance. Uday and Majnu invite a powerful don of the underworld, RDX  to the engagement. At the party, a girl named Ishika  arrives, claiming to be Rajiv's childhood betrothed. Ishika is actually a friend that Dr. Ghunghroo asked to come and try to break off the engagement. Ishika manages to do so, leaving Rajiv and Sanjana heartbroken. Dr. Ghunghroo reveals that he did this for Rajiv's mother, who had married into a crime family and was harassed and tortured, thus telling Dr. Ghunghroo to raise Rajiv away from crime when he was born. Dr. Ghunghroo decides he will agree to the marriage only if Uday and Majnu give up their life of crime. Rajiv and Sanjana do this by reawakening Uday's love for acting and encouraging Majnu to pursue his love for painting. With these things keeping them busy, Uday and Majnu have no time for crime anymore. Rajiv's actions anger RDX's son, Lucky, who attempts to shoot Rajiv. Sanjana gets hold of the gun and fires a shot that hits Lucky, causing him to go unconscious. RDX is informed of his son's death and comes to attend the cremation. However Lucky, who is still alive, escapes, trying to show his father that he's actually alive. RDX sets the pile of wood on fire, believing he is cremating his son's body. However Lucky, who had been hiding under the wood, jumps out upon realizing the wood is on fire, and the truth is revealed to RDX. Rajiv, Ghunghroo, his wife, Ishika, Uday, Majnu and Sanjana are captured by RDX and brought to a cabin set next to a cliff. The frightened group is forced to play Hot Potato with a globebut the one who ends up with the globe must jump off the cliff. When Rajiv refuses to pass the globe to Sanjana, Lucky angrily yanks it out of his hands, just as the music stops. Now that his son has the globe, RDX figures the only way he can maintain his image is by killing everyone. Before he can, several government brokers sneak up and cut the footings of the cabin, causing the house to start falling over the cliff, with everyone trapped inside. However, the cabin is suspended by only one column. Hilarious chaos ensues as the group tries to balance the cabin together and keep it from falling off the cliff. Rajiv finds a rope and the group uses it to get back onto stable ground. But to everyone's shock, the floor broke and Lucky was hanging on the edge of the cabin. While Rajiv is trying to rescue him, Sanjana reveal the truth to everyone that she was the one who shooted Lucky, but Rajiv blamed himself so that Sanjana won't get in trouble. After Rajiv rescued Lucky, the cabin he is standing on fell off a cliff. Sanjana kept crying for him thinking he is dead. However, Rajiv survived the event and is reunited with Sanjana and his family. Lucky and RDX are grateful to Rajiv for saving their lives and RDX gives up his life of crime, allowing Rajiv and Sanjana to finally get married.",
        "wiki_id": 5767035
    },
    {
        "country": "India",
        "genre": "Action, Action/Adventure, Bollywood",
        "lang": "Hindi Language",
        "name": "Dhoom",
        "release": 2004,
        "summary": "The story starts in the city of Mumbai where a motorcycle gang starts breaking into banks and other public places and vanishing on the Western Express Highway. ACP Jai Dixit  a no-nonsense cop, is called inside the case. He is married to Sweety . Jai seeks the help of a thief named Ali  and devises a trap to catch the gang, but it fails. Kabir ([[John Abraham , the leader of the gang, eventually taunts Dixit by saying that he couldn't catch him even if he were right in front of him. He is proved correct and the failure of Dixit seemingly leads to the break-up of his partnership with Ali. Kabir then lures Ali into his gang to take place of Rohit, the gang member who was killed by Jai. Ali falls in love with Sheena , another gang member. The gang later goes to Goa to perform one last big heist before becoming disbanded forever. Kabir now sets his eyes on the biggest casino in all of India. Kabir and his gang swiftly loot the casino on New Year's Eve, but soon they realize that Jai has led them right into a trap. Ali was working for Jai the whole time and a fight ensues. Kabir manages to escape from Jai, and goes back to the gang's truck where Ali has tied up Sheena. Kabir then viciously beats up Ali for his betrayal, but Ali is saved by the timely arrival of Jai at the scene. The gang minus Sheena flees, while Jai and Ali give chase. All the gang members sans Kabir are killed by Jai and Ali. Kabir tries to escape on his bike. He is then cornered by Jai and Ali with nowhere to go. So Kabir decides to commit suicide rather than let Jai arrest him, and rides his bike over the edge of a cliff and into the water. The movie ends with Jai and Ali bickering as usual. It is hinted at the end that Sheena will be arrested.",
        "wiki_id": 1828869
    },
    {
        "country": "India",
        "genre": "Action Thrillers, Action/Adventure, Action",
        "lang": "Hindi Language, English Language, Urdu Language",
        "name": "Dhoom 2",
        "release": 2006,
        "summary": "The film begins with Mr. A  sky-diving and landing on a train that is carrying the British Queen. He steals her crown by disguising himself as the Queen and escapes. Newly-promoted officer Ali  and Jai Dixit  are introduced to Shonali Bose , a special officer assigned to investigate Mr. A's case, who also happens to be a former classmate of Jai. After the initial investigation, Dixit analyzes the underlying trend in Mr. A's heists. As per his analysis, a theft in one of two famous Mumbai city museums will follow. However, Dixit realizes that the artifact in the museum he is guarding happens to be imperfect. He immediately flees to the other museum when a disguised Mr. A steals a rare diamond and escapes. In a televised challenge to the police, Mr. A announces that he will steal an ancient warrior sword. In response, Dixit, Bose and Khan enforce a strict vigil at the location housing the sword. At night, Mr. A meets his impersonator in the room that holds the sword. The police are alerted, but they manage to steal the sword and escape. The impersonator turns out to be Sunehri , a woman who idolizes Mr. A, and after this they form an alliance. In Rio de Janeiro, Mr. A and Sunehri plan their next heist. As Dixit's analysis has named Rio the location of Mr. A's next heist, Jai and Ali travel to the city. Meanwhile, the relationship between Mr. A and Sunehri evolves into romance. He unveils his real identity, Aryan, to her. However, Mr. A discovers that Sunehri is a spy working for Jai after seeing them together at a theatre and then a parade. Aryan forces Sunehri to play a game of Russian roulette. Sunehri cries and refuses to shoot Aryan because she loves him, but Aryan forces her. However, after six attempted shots from the gun, neither is injured because Aryan had not inserted a bullet into the gun. Sunehri admits she betrayed Aryan and that she loves him. Elsewhere in Rio de Janeiro, Ali develops strong affections towards Monali , Shonali's twin sister. In their final heist, Aryan and Sunehri successfully steal some early Lydian coins while disguised as performing dwarfs. Sunehri indicates that she does not wish to remain allied with Jai, forcing Jai and Ali to go after them. After the chase, all of them end up on the top of a waterfall, where Sunehri is caught by Ali. Sunehri, despite conveying her feelings for Aryan, shoots him. Aryan falls from the waterfall, after which Jai allows Sunehri to go free. After six months, it is revealed that Aryan is still alive and has opened a restaurant in the Fiji islands with Sunehri. Jai meets Aryan and Sunehri at the restaurant and states that despite their crimes, he does not wish to imprison the couple. Aryan shows him where all the stolen artifacts can be found. Jai is aware of the couple's feelings towards each other, but warns them against returning to their life of crime.",
        "wiki_id": 2513427
    },
    {
        "country": "India",
        "genre": "World cinema, Bollywood, Comedy",
        "lang": "Hindi Language",
        "name": "Munna Bhai M.B.B.S.",
        "release": 2003,
        "summary": "Murli Prasad Sharma, nicknamed Munna Bhai  is a bhai or gunda: a crime don in the Mumbai underworld. Given that his father had wished him to be a medical doctor, he creates the faux Sri Hari Prasad Sharma Charitable Hospital  and pretends to live in accordance with this wish whenever his father  and mother  visit him in Mumbai. One year, however, Munna's plan goes awry when his father meets an old acquaintance, Dr. Asthana  and the two older men decide to marry Munna to Asthana's daughter, Dr. Suman Chinki . At this point the truth about Munna is revealed. Asthana insults Munna's parents and calls them fools for being ignorant of Munna's real life. Munna's father and mother, aghast and later heartbroken, leave for their village. Munna, in grief and despair, decides that the only way to redeem himself and to gain revenge for the humiliation suffered by his father at the hands of the spiteful Ashthana is to become a doctor. He decides to go to a medical college to obtain an M.B.B.S. degree, the graduate medical degree in South Asia. With the help of his right-hand man Circuit and others, Munna gains admission to the Imperial Institute of Medical Sciences, where he again encounters Dr. Asthana, who is the dean. His success there becomes dependent upon the  help of faculty member Dr. Rustam Pavri .  While Munna Bhai's skills as a medical doctor are minimal, he transforms those around him with the Jadoo Ki Jhappi  &mdash; a method of comfort taught to Munna by his mother &mdash; and the compassion he shows towards those in need. Despite the school's emphasis on mechanical, Cartesian, impersonal, often bureaucratic relationships between doctors and patients, Munna constantly seeks to impose a more empathetic, almost holistic, regimen. To this end, he defies all convention by treating a brain-dead man called Anand bhai as if the man were able to perceive and understand normally; interacts on familiar but autocratic terms with patients; humiliates school bullies; effusively thanks a hitherto-underappreciated janitor; and encourages the patients themselves to make changes in their lives, so that they do not need drugs or surgery. Dr. Asthana, who perceives all this as symptoms of chaos, is unable to prevent it from expanding and gaining ground at his college. He becomes increasingly irrational, almost to the point of insanity. Repeatedly, this near-dementia is shown when he receives unwelcome tidings and he begins laughing in a way that implies that he has gone mad. This behavior is explained early on as an attempt to practice laughter therapy, an attempt that seems to have backfired &mdash; Asthana's laughing serves more to convey his anger than diffuse it. Meanwhile, his daughter becomes increasingly fond of Munna, who in his turn becomes unreservedly infatuated with her. Some comedy appears here, because Munna is unaware that Dr. Suman and his childhood friend Chinki are one and the same; an ignorance that Suman hilariously exploits. Asthana tries several times to expel Munna but is often thwarted by Munna's wit or the affection with which the others at the college regard Munna, having gained superior self-esteem by his methods. Eventually, Munna is shamed into leaving the college: His guilt for not being able to help a dying friend gets the better of him. In the moments immediately following Munna's departure, Anand miraculously awakens from his vegetative state; at this point Suman gives a heartfelt speech wherein she criticizes her father for having banished Munna, saying that to do so is to banish hope, compassion, love, and happiness, etc. from the college. Asthana eventually realizes his folly. Munna later marries Dr. Suman, learning for the first time that she is Chinki. The medical college &mdash; under Rustam Pavri's management since Asthana's retirement &mdash; begins to imitate Munna's radical methods of treatment. Munna and Suman open a hospital in Munna's home village, where they implement Munna's ideas daily. This, in addition to the birth of their offspring, earns Munna the nickname Munnabhai  M.B.B.S. - Miya Biwi Bachhon Samet . Munna's parents reconcile with him. His sidekick Circuit marries and has a son, who is nicknamed Short Circuit. As the film concludes, Anand, restored to normal mental health, narrates the story to children.",
        "wiki_id": 903140
    },
    {
        "country": "India",
        "genre": "Action, Romance Film, Comedy",
        "lang": "Hindi Language, English Language",
        "name": "Bodyguard",
        "release": 2011,
        "summary": "Balwanth Singh is the bodyguard of Sartaj Rana  with high competencies. During one night, Balwanth, along with his pregnant wife, meet with an accident proving fatal for Balwanth while his wife is rescued by Sartaj, and she later gives birth to a child named Lovely. Lovely Singh , now grown up, works in a security agency. On Sartajs order, Lovely busts a human trafficking racket operated by Ranjan Mahatre  and his brothers. Fearing revenge from his enemies, Sartaj calls upon Lovely and appoints him as the Bodyguard of his daughter Divya . Lovely Singh is very devoted to his duties but eventually irritates Divya all the time by following her everywhere from her college campus to her classroom. Consequently, Divya and her friend Maya  call Lovely from a private mobile number and start a prank love affair, hoping to keep him away from them. Initially hesitant, Lovely gradually starts loving the mystery girl Chhaya but doesn't realise that it is actually Divya calling her as Chhaya. Meanwhile, Lovely protects Divya on many occasions from the attacks of Ranjan Mahatre and his goons. This results in Divya too falling in love with Lovely but is scared to reveal her identity due to Lovelys immense devotions towards his duties and her father. Further some circumstances lead Sartaj to begin suspecting that Lovely and Divya are in love and they might elope. He sends his men to kill Lovely in case his lover turns out to be Divya. Divya convinces her father that they are not running away and instead Lovelys love is someone else and is waiting for him at the railway station. Sensing that Lovely might be heartbroken if he does not meet his lover at the station, Divya sends her friend Maya to tell Lovely her true identity. Lovely, after waiting for long at the station platform, finally sees Maya and asks her why she didn't tell him that she is Chhaya. Maya tries to tell him that Divya is Chhaya, but sees one of Sartaj's men in the compartment, waiting for her to answer Lovely. Maya is forced to tell Lovely that she is Chhaya and she loves him As Lovely and Maya hug, Divya calls. In the spur of the moment, Maya throws her phone out of the train, thus erasing Divya out of their love life completely. They both get married but soon Maya dies after giving birth to a child. She writes notes to their son in a diary about the fraud she committed with her best friend Divya and asks him to unite Lovely and Divya. Several years later, Sartaj invites Lovely and his son to his house, and apologises for his behaviour. Lovely believed that Divya is married and happily settled in London but is shocked to see her there in the house and had still not married,while her look was like married woman. His son grows closer to Divya and even apologises on his mothers behalf. On their last day of visit, while leaving, he asks Divya to accompany him as his mother. Infuriated Lovely asks his son to apologise to Divya but he refuses and walks away. Sartaj tells Lovely that he too feels the same and requests him to take Divya with him to which Lovely gets obliged to accept. At the railway station, Lovely and his son are accompanied by Divya. His son secretly throws away Maya's diary into trash but is eventually recovered by Lovely. On reading it, he discovers that Divya was his actual lover Chhaya. He calls Divya on her cellphone and addresses her as Chhaya. Divya is overwhelmed with joy and happiness realising that Lovely has come to know of the truth and her identity. She runs toward Lovely and they both hug each other while his son is happily watching them.",
        "wiki_id": 28973039
    },
    {
        "country": "India",
        "genre": "Romance Film, Bollywood, Romantic drama",
        "lang": "Hindi Language",
        "name": "Band Baaja Baaraat",
        "release": 2010,
        "summary": "Bittoo Sharma  is street-smart and fun-loving. The movie opens with Bittoo collecting money from others to gatecrash a wedding for tasty food. Intelligent and quirky, Shruti Kakkar , who assists the wedding coordinator, suspects that he is from neither the groom nor bride's side. However, Bittoo is successful in convincing her that he has a right to be there. After watching her dance at the wedding, Bittoo makes a video of her during the dance routine. After finding out her name and college, he tries to give her the DVD to impress her. She accepts it and tells him her dream of opening a wedding-planning company. When Bittoo's father comes to take him back to his village, Bittoo refuses and lies that he and Shruti are going into business together. He goes to Shruti with this idea and she initially refuses, but after seeing his persistence, finally agrees. They name the company Shaadi Mubarak, and with the work equally split between the two, their enterprise becomes a success. Their first project is low-budget but very successful. The flamboyant duo then go on to plan many more small weddings. Later, they migrate to posh colonies of Delhi and get their first big client. After working night and day, their project becomes highly successful. At the night of the event, they dance to celebrate, and Shruti gets drunk. She falls for Bitto, and the two make love that night. The following morning, Bittoo realizes the mistake he has made, as he is not in love with Shruti, but does not want to hurt her feelings. While he acts strangely toward her, Shruti is extremely nice to him, which is unlike her, as she is usually sarcastic and snappy towards him. In an argument, Bittoo throws her own words back at her, that business and pleasure don't mix, and he does not love her. This creates a tense atmosphere between the two, and Bittoo leaves to create his own wedding-planning enterprise. Both of them attempt to prove themselves in the industry and provoke people to go against the other. However, both enterprises end up suffering huge losses. They finally get a contract in which they are asked to work together as a team. Both of them unwillingly take it up for the sake of recovering their own losses. After they start working for the wedding, Bittoo finds out that Shruti is engaged to a businessman in Dubai. Bittoo pesters Shruti, asking her whether her engagement was an attempt to make him jealous. Shruti answers that she is not doing it for revenge, but for her own security and her parents' satisfaction to see her well-settled in life. She acknowledges that she did fall in love with Bittoo, but since he didn't feel the same, she had moved on. At the sudden thought of losing her forever, Bittoo realizes that he was always been in love with Shruti, but simply didn't know it. Finally, Bittoo and Shruti both acknowledge their love for each other with a passionate kiss. The film ends with both of them dancing at their own wedding, with their friends and family surrounding them.",
        "wiki_id": 29004995
    }
]